cases/artigo_mestrado/on-caso-1.2/_grid/P2000_d1e17_neohooke/fluid/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

// on-caso-1 - velocidade do LCR.
// Inlet/outlet de pressao geram fluxo atraves do lid poroso (Darcy).
// Em estado estacionario: U_max ~ Q/A = ~3e-6 m/s no lid (d=1e12).

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }

    outlet_peri
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }

    fsi_pia          { type movingWallVelocity; value uniform ( 0 0 0 ); }
    fsi_dura         { type movingWallVelocity; value uniform ( 0 0 0 ); }
    lid_wall_inner   { type fixedValue; value uniform ( 0 0 0 ); }
    lid_wall_outer   { type fixedValue; value uniform ( 0 0 0 ); }
}
